Documents/бит_ВводПоказанийПоСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ВводПоказанийПоСчетчикам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_ПоказанияСчетчиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацииВводПоказанийПоСчетчикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнитьТаблицуСчетчиковВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПоСчетчикам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дом</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПоСчетчику</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Многотарифный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходЧерезНоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрядность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаОтключена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКвартиры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СчетчикиНаУслугахОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СчетчикиНаУслугахОбщий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_ПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ПоказанияСчетчиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоследниеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияИнспектора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеПоказанияНаселения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказанияПодкрутка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/бит_ТипСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Групповой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыОперацииВводПоказанийПоСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацииВводПоказанийПоСчетчикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказанияПодкрутки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ВводПоказанийПоСчетчикам/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.
&НаКлиенте
Перем тмпКонечныеПоказания;      // Хранит конечные показания. Клиент.
&НаКлиенте
Перем тмпПоказания;              // Хранит показания. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
&НаСервере 
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ПоказанияПоСчетчикамУлица.Видимость       = ?(Объект.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой,Ложь,(Объект.Улица = Справочники.бит_СписокУлиц.ПустаяСсылка())); 
	Элементы.ПоказанияПоСчетчикамЛицевойСчет.Видимость = ?(Объект.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой,Ложь,(Объект.ЛицевойСчет = Справочники.бит_ЛицевыеСчета.ПустаяСсылка()));
	
	Если Объект.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки Тогда
		
		Элементы.ЧислоПоказанияНаселения.Видимость                   = Ложь;
		Элементы.ПоказанияПоСчетчикамТекущиеПоказания.ТолькоПросмотр = Истина;
		
	Иначе
		
		Элементы.ЧислоПоказанияНаселения.Видимость                   = Истина;
		Элементы.ПоказанияПоСчетчикамТекущиеПоказания.ТолькоПросмотр = Ложь;
		
	КонецЕсли;
	
	Если Объект.ЗаполнитьТаблицуСчетчиковВРучную Тогда
		
		Элементы.ПоказанияПоСчетчикамСменаВвода.Пометка = Истина;
		Элементы.ПоказанияПоСчетчикамСменаВвода.Заголовок = "Режим заполнения: ""Ручной"""; 
		
	КонецЕсли;
	
	Если Объект.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		
		Элементы.ЧислоПоказанияНаселения.Доступность = Ложь;
		Элементы.ЛицевойСчет.Видимость               = Ложь;
		
	Иначе
		
		Элементы.ЧислоПоказанияНаселения.Доступность = Истина;
		Элементы.ЛицевойСчет.Видимость               = Истина;
		
	КонецЕсли;
	
	// БИТ ЖКХ 02.04.2021
	ЧислоПоказанияНаселения = НЕ Объект.ПоказанияНаселения;
	
	
	Элементы.ПоказанияПоСчетчикамСчетчик.КнопкаВыбора     = Объект.ЗаполнитьТаблицуСчетчиковВРучную;
	Элементы.ПоказанияПоСчетчикамЛицевойСчет.КнопкаВыбора = ?(Объект.ЗаполнитьТаблицуСчетчиковВРучную, НЕ ЗначениеЗаполнено(Объект.ЛицевойСчет), Ложь);
	Элементы.ПоказанияПоСчетчикамДом.КнопкаВыбора         = ?(Объект.ЗаполнитьТаблицуСчетчиковВРучную, НЕ ЗначениеЗаполнено(Объект.Дом), Ложь);
	Элементы.ПоказанияПоСчетчикамУлица.КнопкаВыбора       = Объект.ЗаполнитьТаблицуСчетчиковВРучную;
	
	Элементы.ПоказанияПоСчетчикамУлица.ПропускатьПриВводе       = НЕ Объект.ЗаполнитьТаблицуСчетчиковВРучную;
	Элементы.ПоказанияПоСчетчикамЛицевойСчет.ПропускатьПриВводе = НЕ Объект.ЗаполнитьТаблицуСчетчиковВРучную;
	Элементы.ПоказанияПоСчетчикамДом.ПропускатьПриВводе         = НЕ Объект.ЗаполнитьТаблицуСчетчиковВРучную;
	Элементы.ПоказанияПоСчетчикамСчетчик.ПропускатьПриВводе     = НЕ Объект.ЗаполнитьТаблицуСчетчиковВРучную;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;

	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	УправлениеЭлементамиФормы();
	
	// БИТ_ЖКХ 10.12.2014{{
	ИнтерфейсТакси = ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
	Если НЕ ИнтерфейсТакси Тогда
		
		Элементы.Группа6.Высота = 0;
		Элементы.Группа6.РастягиватьПоВертикали = Истина; 
		
	КонецЕсли;	
	// БИТ_ЖКХ 10.12.2014}}	
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ПоказанияПоСчетчикам.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Таблица показаний счетчиков будет очищена. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	иначе	
		ЗаполнитьТаблицуПоказанийНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуПоказанийНаСервере();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УслугаНеРассчитывается(Команда)
	
	УслугаНеРассчитывается = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура СменаВвода(Команда)
	
	Если Элементы.ПоказанияПоСчетчикамСменаВвода.Пометка Тогда
		
		Элементы.ПоказанияПоСчетчикамСменаВвода.Пометка   = Ложь;
		Элементы.ПоказанияПоСчетчикамСменаВвода.Заголовок = "Режим заполнения: ""Автоматический""";
		Объект.ЗаполнитьТаблицуСчетчиковВРучную           = Ложь;
		
	Иначе
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для вида операции ""Показания подкрутки"" ручной режим заполнения не доступен.'"),, "Объект");
			Возврат;	
		КонецЕсли;
		
		Элементы.ПоказанияПоСчетчикамСменаВвода.Пометка   = Истина;
		Элементы.ПоказанияПоСчетчикамСменаВвода.Заголовок = "Режим заполнения: ""Ручной""";
		Объект.ЗаполнитьТаблицуСчетчиковВРучную           = Истина;
		
	КонецЕсли; 
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ЗаполнитьТаблицуСчетчиковВРучную Тогда
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_ВидыОперацииВводПоказанийПоСчетчикам.ВводПоказаний");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для вида операции ""Показания подкрутки"" ручной режим заполнения не доступен.'"),, "Объект");
	КонецЕсли;
	
	Объект.ПоказанияПоСчетчикам.Очистить();
	
	УправлениеЭлементамиФормы();
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСчетчикаПриИзменении(Элемент)
	
	Объект.ЛицевойСчет = ПолучитьПустойЛицевойСчет(); 
	Объект.ПоказанияПоСчетчикам.Очистить();
	
	УправлениеЭлементамиФормы();
	
	Объект.ПоказанияНаселения = НЕ Объект.ТипСчетчика = ПолучитьГрупповойТипСчетчика();
	
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	
	Объект.Дом         = ПолучитьПустойСписокЗданий();
	Объект.ЛицевойСчет = ПолучитьПустойЛицевойСчет();
	
	Объект.ПоказанияПоСчетчикам.Очистить();
	
	//ЗаполнитьТаблицуПоказанийНаСервере();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Улица) Тогда
		
		Объект.Улица = ПолучитьУлицуДома(Объект.Дом);
		
	КонецЕсли;
	
	Объект.ЛицевойСчет = Неопределено;
	
	Объект.ПоказанияПоСчетчикам.Очистить();
	
	ЗаполнитьТаблицуПоказанийНаСервере();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("Улица"      , Объект.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Улица) Тогда
		
		Объект.Улица = ПолучитьУлицуЛицевогоСчета(Объект.ЛицевойСчет);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Дом) Тогда
		
		Объект.Дом   = ПолучитьЗданиеЛицевогоСчета(Объект.ЛицевойСчет);
		
	КонецЕсли;
	
	Объект.ПоказанияПоСчетчикам.Очистить();
	
	ЗаполнитьТаблицуПоказанийНаСервере();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Улица) Тогда
		
		Отбор.Вставить("УлицаЛицевогоСчета", Объект.Улица);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Дом) Тогда
		
		Отбор.Вставить("Здание", Объект.Дом);
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	Объект.ПоказанияПоСчетчикам.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ Объект.ЛицевойСчет = ПолучитьПустойЛицевойСчет() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СписокУслуг = ПолучитьСписокЗначенийУслуг();
		
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", СписокУслуг);
		
		ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСчетчикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ВидОперации = ПолучитьВидОперацииПоказанияПодкрутки() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ВыбранноеЗначение = ПолучитьГрупповойТипСчетчика() Тогда
			
			// БИТ_ЖКХ 03.03.2015{{
			// Сообщить("Показания подкрутки вводятся только по индивидуальному счетчику.", СтатусСообщения.ОченьВажное);.
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Показания подкрутки вводятся только по индивидуальному счетчику.";
			Сообщение.Сообщить();
			// БИТ_ЖКХ 03.03.2015}}
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	
	Если ЭтаФорма.Значение.Количество() > 0 Тогда
		
		ЭтаФорма.ФлагОтбора = Истина;
		
	Иначе
		
		ЭтаФорма.ФлагОтбора = Ложь;
		
	КонецЕсли;
	
	Если ЭтаФорма.ФлагОтбора = Истина Тогда
		
		ИзменитьУсловноеОформлениеНаСервере(Истина);
		
	Иначе
		
		ИзменитьУсловноеОформлениеНаСервере(Ложь);
		
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли; 
	
	Отказ = НЕ Объект.ЗаполнитьТаблицуСчетчиковВРучную;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ТекСтрока.Многотарифный Тогда
		
		Отказ = Истина;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Счетчик"    , ТекСтрока.Счетчик);
		
		МассивСтрок = Объект.ПоказанияПоСчетчикам.НайтиСтроки(Отбор);
		
		Для каждого Строка Из МассивСтрок Цикл
			
			Объект.ПоказанияПоСчетчикам.Удалить(Строка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено И НЕ тмпКонечныеПоказания = Неопределено Тогда
		
		ТекущиеДанные.ТекущиеПоказания = Число(тмпКонечныеПоказания);
		
	КонецЕсли; 
	
	тмпКонечныеПоказания = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекСтрока = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
		
		Если ЗначениеЗаполнено(Объект.Дом) Тогда
			
			ТекСтрока.Дом         = Объект.Дом;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
			
			ТекСтрока.ЛицевойСчет = Объект.ЛицевойСчет;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Улица) Тогда
			
			ТекСтрока.Улица       = Объект.Улица;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамДомНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	ТекУлица = ПолучитьПустуюУлицу();
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		ТекУлица = ТекСтрока.Улица;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Улица) Тогда
		
		ТекУлица = Объект.Улица;
		
	КонецЕсли;
	
	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(ТекУлица) Тогда
		
		Отбор.Вставить("Улица", ТекУлица);
		
	Иначе
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Укажите улицу.", СтатусСообщения.Информация);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Укажите улицу.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	Отбор = Новый Структура;
	
	Если НЕ ТекСтрока = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.Улица) Тогда
			
			Отбор.Вставить("УлицаЛицевогоСчета", ТекСтрока.Улица);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.Дом) Тогда
			
			Отбор.Вставить("Здание", ТекСтрока.Дом);
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Объект.Улица) Тогда
			
			Отбор.Вставить("УлицаЛицевогоСчета", Объект.Улица);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Дом) Тогда
			
			Отбор.Вставить("Здание", Объект.Дом);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамСчетчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	СписокИсключений = Новый Массив;
	
	Для каждого СтрокаТаблицы Из Объект.ПоказанияПоСчетчикам Цикл
		
		Если НЕ СтрокаТаблицы.Многотарифный Тогда
			
			СписокИсключений.Добавить(СтрокаТаблицы.Счетчик);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	СписокЛС = ПолучитьСписокЛС(СписокИсключений, ?( НЕ ТекСтрока = Неопределено, ТекСтрока.Дом, Объект.Дом) , ?( НЕ ТекСтрока = Неопределено, ТекСтрока.ЛицевойСчет, Объект.ЛицевойСчет));
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Ссылка", СписокЛС);
	
	ОткрытьФорму("Справочник.бит_Счетчики.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамСчетчикОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	СтандартнаяОбработка = Ложь;
	
	Если ТекСтрока = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Если НЕ ТекСтрока.Счетчик = ВыбранноеЗначение Тогда
		
		Дом            = ТекСтрока.Дом;
		ЛицевойСчет    = ТекСтрока.ЛицевойСчет;
		Квартира       = ТекСтрока.ЛицевойСчет.Квартира;
		НомерСтроки    = ТекСтрока.ПолучитьИдентификатор();
		СтароеЗначение = ТекСтрока.Счетчик;
		Многотарифный  = ТекСтрока.Многотарифный;
		
		ПоказанияНаСчетчикеСчетчикОбработкаВыбораНаСервере(ВыбранноеЗначение, Дом, ЛицевойСчет, Квартира, НомерСтроки, СтароеЗначение, Многотарифный);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамТекущиеПоказанияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные      = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	КонечныеПоказания   = Число(Текст);
	Разность             = КонечныеПоказания - ТекущиеДанные.ПредыдущиеПоказания;
	
	ПереходЧерезНоль   = Ложь;
	Заполнить          = Истина;
	
	// СтандартнаяОбработка           = Ложь;.
	
	Если КонечныеПоказания < ТекущиеДанные.ПредыдущиеПоказания Тогда
		
		// БИТ_ЖКХ 07.11.2014
		//Разрядность = РазрядностьНаСервере(ТекущиеДанные.Счетчик);
		Разрядность = ЗначениеРеквизитаНаСервере(ТекущиеДанные.Счетчик, "Разрядность");
		
		// Разность = ТекущиеДанные.Счетчик.Разрядность - ТекущиеДанные.ПредыдущиеПоказания + 1 + Число(Текст);.
		Разность = Разрядность - ТекущиеДанные.ПредыдущиеПоказания + 1 + Число(Текст);
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПоказанияПоСчетчикамТекущиеПоказанияОкончаниеВводаТекстаЗавершение", ЭтотОбъект, Новый Структура("КонечныеПоказания, Разность, ТекущиеДанные, ПереходЧерезНоль, Заполнить", КонечныеПоказания, Разность, ТекущиеДанные, ПереходЧерезНоль, Заполнить)), "Произойдет переход через 0 на разность: " + Разность +" Ввести?",РежимДиалогаВопрос.ДаНетОтмена);
        Возврат;
		
	КонецЕсли;
	
	ПоказанияПоСчетчикамТекущиеПоказанияОкончаниеВводаТекстаФрагмент(Заполнить, КонечныеПоказания, ПереходЧерезНоль, Разность, ТекущиеДанные);

	 ДанныеВыбора = КонечныеПоказания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамТекущиеПоказанияОкончаниеВводаТекстаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	КонечныеПоказания = ДополнительныеПараметры.КонечныеПоказания; 
	
    Разность = ДополнительныеПараметры.Разность;
    ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
    
	ПереходЧерезНоль   = ДополнительныеПараметры.ПереходЧерезНоль;
	Заполнить          = ДополнительныеПараметры.Заполнить;
	
    // БИТ_ЖКХ 07.11.2014
    
    Ответ = РезультатВопроса;
	
	СтандартнаяОбработка = Ложь;

    Если Ответ = КодВозвратаДиалога.Нет Тогда
        
        // СтандартнаяОбработка           = Ложь;
        тмпКонечныеПоказания = Формат(ТекущиеДанные.ТекущиеПоказания, "ЧДЦ=4; ЧН=");
        
        Заполнить = ложь;
        
    ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
        
        // СтандартнаяОбработка = Ложь;
        Разность             = 0;
        КонечныеПоказания   = 0;
    Иначе
        
        ПереходЧерезНоль = Истина;
        
    КонецЕсли;
    
    
    ПоказанияПоСчетчикамТекущиеПоказанияОкончаниеВводаТекстаФрагмент(Заполнить, КонечныеПоказания, ПереходЧерезНоль, Разность, ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамТекущиеПоказанияОкончаниеВводаТекстаФрагмент(Знач Заполнить, Знач КонечныеПоказания, Знач ПереходЧерезНоль, Знач Разность, Знач ТекущиеДанные)
    
    Перем СтрокаТаблицы, СтрокиПоиска;
    
    Если Заполнить Тогда
        
        Если НЕ ТекущиеДанные.Многотарифный Тогда
            
            СтрокиПоиска = Объект.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("Счетчик", ТекущиеДанные.Счетчик));
            
            Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
                
                СтрокаТаблицы.ТекущиеПоказания           = КонечныеПоказания;
                СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Разность;
                СтрокаТаблицы.ПереходЧерезНоль           = ПереходЧерезНоль;
                
            КонецЦикла;
            
        Иначе
            
            СтрокиПоиска = Объект.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("Счетчик, Услуга", ТекущиеДанные.Счетчик, ТекущиеДанные.Услуга));
            
            Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
                
                СтрокаТаблицы.ТекущиеПоказания           = КонечныеПоказания;
                СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Разность;
                СтрокаТаблицы.ПереходЧерезНоль           = ПереходЧерезНоль;
                
            КонецЦикла;
            
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Ссылка, Реквизит)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);	
	
КонецФункции

&НаКлиенте
Процедура ПоказанияПоСчетчикамКоличествоЕдиницПоСчетчикуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные      = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	Показания            = Число(Текст);
	КонечныеПоказания    = ТекущиеДанные.ПредыдущиеПоказания + Показания;
	
	ПереходЧерезНоль   = Ложь;
	Заполнить          = Истина;
	
	Если Показания > ТекущиеДанные.Разрядность Тогда
		
		// БИТ_ЖКХ 03.03.2015{{
		// Сообщить("Количество единиц по счетчику не может превышать разрядность.", СтатусСообщения.ОченьВажное);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Количество единиц по счетчику не может превышать разрядность.";
		Сообщение.Сообщить();
		// БИТ_ЖКХ 03.03.2015}}
		
		СтандартнаяОбработка           = Ложь;
		тмпПоказания = Формат(ТекущиеДанные.ТекущиеПоказания, "ЧДЦ=4; ЧН=");
		
		Заполнить = ложь;
		
		Возврат;
		
	КонецЕсли; 
	
	//СтандартнаяОбработка           = Ложь;
	
	Если КонечныеПоказания > ТекущиеДанные.Разрядность Тогда
		
		КонечныеПоказания = ТекущиеДанные.ПредыдущиеПоказания - 1 + Число(Текст) - ТекущиеДанные.Разрядность;
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ПоказанияПоСчетчикамКоличествоЕдиницПоСчетчикуОкончаниеВводаТекстаЗавершение", ЭтотОбъект, Новый Структура("Показания, КонечныеПоказания, ТекущиеДанные, ПереходЧерезНоль, Заполнить",Показания, КонечныеПоказания, ТекущиеДанные, ПереходЧерезНоль, Заполнить)), "Произойдет переход через 0 на конечные показания: " + КонечныеПоказания + " Ввести?",РежимДиалогаВопрос.ДаНетОтмена);
        Возврат;
		
	КонецЕсли;
	
	ПоказанияПоСчетчикамКоличествоЕдиницПоСчетчикуОкончаниеВводаТекстаФрагмент(Заполнить, КонечныеПоказания, ПереходЧерезНоль, Показания, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамКоличествоЕдиницПоСчетчикуОкончаниеВводаТекстаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
    Показания = ДополнительныеПараметры.Показания;
	
    КонечныеПоказания = ДополнительныеПараметры.КонечныеПоказания;
    
    ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
    
	ПереходЧерезНоль   = ДополнительныеПараметры.ПереходЧерезНоль;
	Заполнить          = ДополнительныеПараметры.Заполнить;
	
    Ответ = РезультатВопроса;
    
    Если Ответ = КодВозвратаДиалога.Нет Тогда
        
        // СтандартнаяОбработка           = Ложь;
        тмпПоказания = Формат(ТекущиеДанные.ТекущиеПоказания, "ЧДЦ=4; ЧН=");
        
        Заполнить = ложь;
        
    ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
        
        // СтандартнаяОбработка = Ложь;
        Показания             = 0;
        КонечныеПоказания    = 0;
        
    Иначе
        
        ПереходЧерезНоль = Истина;
        
    КонецЕсли;
    
    
    ПоказанияПоСчетчикамКоличествоЕдиницПоСчетчикуОкончаниеВводаТекстаФрагмент(Заполнить, КонечныеПоказания, ПереходЧерезНоль, Показания, ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамКоличествоЕдиницПоСчетчикуОкончаниеВводаТекстаФрагмент(Знач Заполнить, Знач КонечныеПоказания, Знач ПереходЧерезНоль, Знач Показания, Знач ТекущиеДанные)
    
    Перем СтрокаТаблицы, СтрокиПоиска;
    
    Если Заполнить Тогда
        
        Если НЕ ТекущиеДанные.Многотарифный Тогда
            
            СтрокиПоиска = Объект.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("Счетчик", ТекущиеДанные.Счетчик));
            
            Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
                
                СтрокаТаблицы.ТекущиеПоказания           = КонечныеПоказания;
                СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Показания;
                СтрокаТаблицы.ПереходЧерезНоль           = ПереходЧерезНоль;
                
            КонецЦикла;
            
        Иначе
            
            СтрокиПоиска = Объект.ПоказанияПоСчетчикам.НайтиСтроки(Новый Структура("Счетчик, Услуга", ТекущиеДанные.Счетчик, ТекущиеДанные.Услуга));
            
            Для каждого СтрокаТаблицы Из СтрокиПоиска Цикл
                
                СтрокаТаблицы.ТекущиеПоказания           = КонечныеПоказания;
                СтрокаТаблицы.КоличествоЕдиницПоСчетчику = Показания;
                СтрокаТаблицы.ПереходЧерезНоль           = ПереходЧерезНоль;
                
            КонецЦикла;
            
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоСчетчикамКоличествоЕдиницПоСчетчикуПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено И НЕ тмпПоказания = Неопределено Тогда
		
		ТекущиеДанные.КоличествоЕдиницПоСчетчику = Число(тмпПоказания);
		
	КонецЕсли; 
	
	тмпПоказания = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.ОбновитьПараметрыЖКХ();
	//ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбъект           = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	// Вызов механизма разделения прав доступа.
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,ДокументОбъект,ЭтаФорма);
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда
		
		Объект.Дата               = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Дата;
		Объект.ЛицевойСчет        = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ЛицевойСчет;
		Объект.Улица              = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Улица;
		Объект.Дом                = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.Дом;
		Объект.ТипСчетчика        = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ТипСчетчика;
		Объект.ВидОперации        = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ВидОперации;
		Объект.ПоказанияНаселения = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ПоказанияНаселения;
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		ДокументОбъект.ЗаполнитьТаблицуПоказаний();
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаЧекККМ") Тогда
		
		Объект.Дата               = Параметры.ЗаполнитьИзДокументаЧекККМ.Дата;
		Объект.ВидОперации        = Параметры.ЗаполнитьИзДокументаЧекККМ.ВидОперации;
		Объект.Организация        = Параметры.ЗаполнитьИзДокументаЧекККМ.Организация;
		Объект.ЛицевойСчет        = Параметры.ЗаполнитьИзДокументаЧекККМ.ЛицевойСчет;
		Объект.Ответственный      = Параметры.ЗаполнитьИзДокументаЧекККМ.Ответственный;
		Объект.Улица              = Параметры.ЗаполнитьИзДокументаЧекККМ.Улица;
		Объект.ТипСчетчика        = Параметры.ЗаполнитьИзДокументаЧекККМ.ТипСчетчика;
		Объект.ПоказанияНаселения = Параметры.ЗаполнитьИзДокументаЧекККМ.ПоказанияНаселения;
		
		Объект.ПоказанияПоСчетчикам.Очистить();
		
		Для каждого Счетчик Из Параметры.ЗаполнитьИзДокументаЧекККМ.МассивСчетчиков Цикл
			
			Если Счетчик.ТекущиеПоказания <> 0  Тогда
				
				НоваяСтрока = Объект.ПоказанияПоСчетчикам.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Счетчик);
				
				НоваяСтрока.ЛицевойСчет = Параметры.ЗаполнитьИзДокументаЧекККМ.ЛицевойСчет;
				
				КолЕдиниц = 0 ;
				
				Если Счетчик.ПредыдущиеПоказания > Счетчик.ТекущиеПоказания Тогда
					
					КолЕдиниц = Счетчик.Разрядность - Счетчик.ПредыдущиеПоказания + Счетчик.ТекущиеПоказания + 1;
					
				Иначе
					
					КолЕдиниц = Счетчик.ТекущиеПоказания - Счетчик.ПредыдущиеПоказания;
					
				КонецЕсли; 
				
				НоваяСтрока.КоличествоЕдиницПоСчетчику = КолЕдиниц;
				
			КонецЕсли; 
			
		КонецЦикла;
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
	КонецЕсли;
	
	// Установить видимость реквизитов и заголовков колонок.	
	УправлениеЭлементамиФормы();
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ДокументОбъект, Отказ);
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(СортироватьПоНомеруКвартиры = ложь)

	ЗаполнитьКвартирыПоказанийПоСчетчикам(СортироватьПоНомеруКвартиры);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКвартирыПоказанийПоСчетчикам(СортироватьПоНомеруКвартиры = ложь)
	
	ТаблицаПС = Объект.ПоказанияПоСчетчикам.Выгрузить();
	
	
	ТаблицаНомеров = ПолучитьТаблицуКвартирПоказанияПоСчетчикам(ТаблицаПС, СортироватьПоНомеруКвартиры);	
	Объект.ПоказанияПоСчетчикам.Загрузить(ТаблицаНомеров);
  	 
	
КонецПроцедуры

// Функция возвращает таблицу значений с квартирами лицевых счетов.
//
// Параметры
//  ТаблицаПС   - Таблица значений со списком списком показаний счетчиков.
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица показаний счетчиков с квартирами. Колонки: НомерСтроки, ОсновноеСредство, ИнвентарныйНомер.
//
Функция ПолучитьТаблицуКвартирПоказанияПоСчетчикам(ТаблицаПС, СортироватьПоНомеруКвартиры = ложь)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивЛС", ТаблицаПС.ВыгрузитьКолонку("ЛицевойСчет"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Квартира КАК Квартира,
	|	бит_ЛицевыеСчета.Квартира.НомерКвартиры КАК НомерКвартиры
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&МассивЛС)";
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();;
	
	ТаблицаРезультата = ТаблицаПС.Скопировать();
	Если ТаблицаРезультата.Колонки.Найти("Квартира") = Неопределено Тогда 
		ТаблицаРезультата.Колонки.Добавить("Квартира", Новый ОписаниеТипов("СправочникСсылка.бит_Квартиры"));
	КонецЕсли;
	
	Для Каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл
		
		СтрокиРезультата = ТаблицаРезультата.НайтиСтроки(Новый Структура("ЛицевойСчет", СтрокаЗапроса.ЛицевойСчет));
		
		Если СтрокиРезультата.Количество() > 0 Тогда
			Для Каждого Стр Из СтрокиРезультата Цикл
				Стр.Квартира = СтрокаЗапроса.Квартира;
				Стр.НомерКвартиры = СтрокаЗапроса.Квартира.НомерКвартиры;
			КонецЦикла;
		КонецЕсли;
	
	КонецЦикла;
	// БИТ ЖКХ 27.10.2020
	если СортироватьПоНомеруКвартиры = истина тогда
	 //ТаблицаРезультата.Сортировать("НомерКвартиры");
	 ТаблицаРезультата.Сортировать("Дом Возр, НомерКвартиры Возр, ЛицевойСчет Возр, Счетчик Возр, Услуга Возр");	
	конецесли;
	Возврат ТаблицаРезультата;

КонецФункции

&НаКлиенте
Процедура ПоказанияПоСчетчикамЛицевойСчетПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ПоказанияПоСчетчикам.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.ЛицевойСчет) Тогда
		ТекСтрока.Квартира =  ЗначениеРеквизитаНаСервере(ТекСтрока.ЛицевойСчет, "Квартира");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьЗданиеЛицевогоСчета(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Здание;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУлицуЛицевогоСчета(ЛицевойСчет)
	
	Возврат ЛицевойСчет.УлицаЛицевогоСчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУлицуДома(Дом)
	
	Возврат Дом.Улица;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЗначенийУслуг()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата",Объект.Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет",Объект.ЛицевойСчет);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет
	|) КАК бит_СведенияПоУслугамЛССрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	СписокУслуг = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокУслуг.Добавить(Выборка.Услуга);
	КонецЦикла;
	
	Возврат СписокУслуг;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЛС(СписокИсключений, Дом , ЛицевойСчет)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &Объект
	|				И ТипСчетчика = &ТипСчетчика
	|				И (НЕ Счетчик В (&СписокИсключений))) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик";
	
	Запрос.УстановитьПараметр("Дата"            , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("ТипСчетчика"     , Объект.ТипСчетчика);
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	Если Объект.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		Запрос.УстановитьПараметр("Объект", Дом);
	Иначе
		Запрос.УстановитьПараметр("Объект", ЛицевойСчет);
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = Новый СписокЗначений;
	СписокЛС.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Счетчик"));
	
	Возврат СписокЛС;
	
КонецФункции

&НаСервере
Процедура ПоказанияНаСчетчикеСчетчикОбработкаВыбораНаСервере(ВыбранноеЗначение, Дом, ЛицевойСчет, Квартира, НомерСтроки, СтароеЗначение, Многотарифный)
	
	ДокументОбъект           = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.ОбновитьПараметрыЖКХ();
	мСчетчикиПодкруткаСервер = ДокументОбъект.мСчетчикиПодкрутка;
	мПодкруткаНаЛСНаСервере  = ДокументОбъект.мПодкруткаНаЛС;
	
	Запрос = Новый Запрос;
	МВТ    = Новый МенеджерВременныхТаблиц;
	
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	ТекстИндивидуальныеСчетчики =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.НачислятьПоНорме
	|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик КАК Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать КАК Использовать,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет = &Объект) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|	И бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Услуги.ЛицевойСчет КАК ЛицевойСчет,
	|	Услуги.Услуга КАК Услуга,
	|	Услуги.РежимПотребления КАК РежимПотребления,
	|	Услуги.Поставщик КАК Поставщик,
	|	Услуги.Использовать КАК Использовать,
	|	Услуги.СпособРасчета КАК СпособРасчета,
	|	Услуги.КоличествоЕдиницПотребления КАК КоличествоЕдиницПотребления,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры КАК ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры КАК СтатусКвартиры,
	|	Проживающие.КолПроживающих КАК КолПроживающих
	|ПОМЕСТИТЬ Сведения
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних
	|		ПО Услуги.ЛицевойСчет.Квартира = бит_СведенияОКвартиреСрезПоследних.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
	|		ПО Услуги.ЛицевойСчет = Проживающие.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сведения.ЛицевойСчет КАК ЛицевойСчет,
	|	Сведения.Услуга КАК Услуга,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(Сведения.КолПроживающих, 0) КАК КолПроживающих,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(бит_НормыНаУслугиСрезПоследних.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного
	|ПОМЕСТИТЬ Нормы
	|ИЗ
	|	Сведения КАК Сведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НормыНаУслуги.СрезПоследних(
	|				&Дата,
	|				Услуга В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						таб.Услуга КАК Услуга
	|					ИЗ
	|						Услуги КАК таб)) КАК бит_НормыНаУслугиСрезПоследних
	|		ПО Сведения.Услуга = бит_НормыНаУслугиСрезПоследних.Услуга
	|			И Сведения.РежимПотребления = бит_НормыНаУслугиСрезПоследних.РежимПотребления
	|			И Сведения.СпособРасчета = бит_НормыНаУслугиСрезПоследних.СпособРасчетаПоУслуге
	|			И Сведения.ТипКвартиры = бит_НормыНаУслугиСрезПоследних.ТипКвартиры
	|			И Сведения.СтатусКвартиры = бит_НормыНаУслугиСрезПоследних.СтатусКвартиры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПредыдущиеПоказания,
	|	ЕСТЬNULL(Нормы.НаОдного, 0) КАК НаОдного,
	|	ЕСТЬNULL(Нормы.НаДвоих, 0) КАК НаДвоих,
	|	ЕСТЬNULL(Нормы.НаСемью, 0) КАК НаСемью,
	|	ЕСТЬNULL(Нормы.НаСемью4, 0) КАК НаСемью4,
	|	ЕСТЬNULL(Нормы.НаСемью5, 0) КАК НаСемью5,
	|	ЕСТЬNULL(Нормы.НаСемью6, 0) КАК НаСемью6,
	|	ЕСТЬNULL(Нормы.НаЛицевойСчет, 0) КАК НаЛицевойСчет,
	|	ЕСТЬNULL(Нормы.КолПроживающих, 0) КАК КолПроживающих,
	|	ЕСТЬNULL(Нормы.ДопНормаНаСемью, 0) КАК ДопНормаНаСемью,
	|	ЕСТЬNULL(Нормы.ДопНормаНаКаждого, 0) КАК ДопНормаНаКаждого,
	|	ЕСТЬNULL(Нормы.ИспользоватьДопНормуНаОдного, ЛОЖЬ) КАК ИспользоватьДопНормуНаОдного,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(
	|			&Дата,
	|			Объект = &Объект
	|				И Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(
	|				&Дата,
	|				Объект = &Объект
	|					И Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Нормы КАК Нормы
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = Нормы.ЛицевойСчет
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = Нормы.Услуга
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ ПО
	|	Счетчик";
	
	ТекстГрупповыеСчетчики =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Объект КАК Объект,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга КАК Услуга,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик КАК Счетчик,
	|	бит_СчетчикиНаУслугахСрезПоследних.Счетчик.Разрядность КАК Разрядность,
	|	ЕСТЬNULL(бит_ПоказанияСчетчиковОстатки.ПоследниеПоказанияОстаток, 0) КАК ПредыдущиеПоказания,
	|	0 КАК НаОдного,
	|	0 КАК НаДвоих,
	|	0 КАК НаСемью,
	|	0 КАК НаЛицевойСчет,
	|	0 КАК КолПроживающих,
	|	0 КАК ДопНормаНаСемью,
	|	0 КАК ДопНормаНаКаждого,
	|	ЛОЖЬ КАК ИспользоватьДопНормуНаОдного,
	|	бит_СчетчикиНаУслугахСрезПоследних.Услуга.Приоритет КАК Приоритет,
	|	бит_СчетчикиНаУслугахСрезПоследних.Многотарифный
	|ИЗ
	|	РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&Дата, Счетчик = &Счетчик) КАК бит_СчетчикиНаУслугахСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Остатки(&Дата, Счетчик = &Счетчик) КАК бит_ПоказанияСчетчиковОстатки
	|		ПО бит_СчетчикиНаУслугахСрезПоследних.Объект = бит_ПоказанияСчетчиковОстатки.Объект
	|			И бит_СчетчикиНаУслугахСрезПоследних.Услуга = бит_ПоказанияСчетчиковОстатки.Услуга
	|			И бит_СчетчикиНаУслугахСрезПоследних.Счетчик = бит_ПоказанияСчетчиковОстатки.Счетчик
	|ГДЕ
	|	бит_СчетчикиНаУслугахСрезПоследних.Использовать
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|ИТОГИ ПО
	|	Счетчик";
	
	Запрос.УстановитьПараметр("Дата"   , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Счетчик", ВыбранноеЗначение);
	
	Если Объект.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой Тогда
		Запрос.УстановитьПараметр("Объект", Дом);
		Запрос.Текст = ТекстГрупповыеСчетчики;
	Иначе
		Запрос.УстановитьПараметр("Объект"  , ЛицевойСчет);
		Запрос.УстановитьПараметр("Квартира", Квартира); 
		Запрос.Текст = ТекстИндивидуальныеСчетчики;
	КонецЕсли; 
	
	ВыборкаСЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	Пока ВыборкаСЧ.Следующий() Цикл
		
		ТекПоказания = 0;
		Показания    = 0;
		Выборка   = ВыборкаСч.Выбрать();
		ПерваяСтрока = Истина;
		
		Пока Выборка.Следующий() Цикл
			
			Если ПерваяСтрока Тогда
				
				Строка = Объект.ПоказанияПоСчетчикам.НайтиПоИдентификатору(НомерСтроки);
				
			Иначе
				
				Строка = Объект.ПоказанияПоСчетчикам.Добавить();
				
			КонецЕсли;
			
			Если Объект.ТипСчетчика = Перечисления.бит_ТипСчетчика.Групповой  Тогда
				
				Строка.Улица = Выборка.Объект.Улица;
				Строка.Дом   = Выборка.Объект;
				
			Иначе
				
				Строка.Улица       = Выборка.Объект.УлицаЛицевогоСчета;
				Строка.Дом         = Выборка.Объект.Здание;
				Строка.ЛицевойСчет = Выборка.Объект;
				
			КонецЕсли; 
			
			Строка.Счетчик                    = ВыбранноеЗначение;
			Строка.Услуга                     = Выборка.Услуга;
			Строка.Разрядность                = Выборка.Разрядность;
			Строка.ПредыдущиеПоказания        = Выборка.ПредыдущиеПоказания;
			Строка.ТекущиеПоказания           = 0;
			Строка.КоличествоЕдиницПоСчетчику = 0;
			Строка.Многотарифный              = Выборка.Многотарифный;
			
			Если Объект.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки Тогда
				
				Если НЕ мСчетчикиПодкруткаСервер Тогда
					
					// БИТ_ЖКХ 03.03.2015{{
					// Сообщить("Подкрутка счетчиков не ведется по этой организации!", СтатусСообщения.ОченьВажное);.
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Подкрутка счетчиков не ведется по этой организации!";
					Сообщение.Сообщить();
					// БИТ_ЖКХ 03.03.2015}}
					
					Объект.ПоказанияПоСчетчикам.Очистить();
					Возврат;
					
				КонецЕсли; 
				
				Если ТекПоказания <> 0 Тогда
					
					Строка.ТекущиеПоказания           = ТекПоказания;
					Строка.КоличествоЕдиницПоСчетчику = Показания;
					
				Иначе
					
					Норма     = 0;
					Показания = 0;
					КолПроживающих = ?(Выборка.КолПроживающих = 0, 1, Выборка.КолПроживающих);
					
					Если КолПроживающих = 1 Тогда
						
						Норма  = Выборка.НаОдного + ?(Выборка.ИспользоватьДопНормуНаОдного,Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого,0);
						
					ИначеЕсли КолПроживающих = 2 Тогда
						
						Норма  = Выборка.НаДвоих * 2 + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * 2;
						
					ИначеЕсли КолПроживающих = 3 Тогда
						
						Норма  = Выборка.НаСемью * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
						
					ИначеЕсли КолПроживающих = 4 Тогда
						
						Норма  = Выборка.НаСемью4 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
						
					ИначеЕсли КолПроживающих = 5 Тогда
						
						Норма  = Выборка.НаСемью5 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
						
					ИначеЕсли КолПроживающих > 5 Тогда
						
						Норма  = Выборка.НаСемью6 * КолПроживающих + Выборка.ДопНормаНаСемью + Выборка.ДопНормаНаКаждого * КолПроживающих;
						
					КонецЕсли;
					
					Если мПодкруткаНаЛСНаСервере Тогда
						
						Показания = Окр(Выборка.НаЛицевойСчет,4);
						
					Иначе
						
						Показания = Окр(Норма,4);
						
					КонецЕсли; 
					
					ТекПоказания = Строка.ПредыдущиеПоказания + Показания;
					
					Если ТекПоказания > Строка.Разрядность Тогда
						
						ТекПоказания = ТекПоказания - Строка.Разрядность + 1;
						Показания    = Показания + 1 ;
						
					КонецЕсли;
					
					Строка.ТекущиеПоказания           = ТекПоказания;
					Строка.КоличествоЕдиницПоСчетчику = Показания;
					
				КонецЕсли; 
				
			КонецЕсли;
			
			ПерваяСтрока  = Ложь;
			УдалитьСтарое = Истина;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	МВТ.Закрыть();
	
	Если НЕ Многотарифный Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("Счетчик"    , СтароеЗначение);
		
		МассивСтрок = Объект.ПоказанияПоСчетчикам.НайтиСтроки(Отбор);
		
		Для каждого Строка Из МассивСтрок Цикл
			
			Объект.ПоказанияПоСчетчикам.Удалить(Строка);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоказанийНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.ЗаполнитьТаблицуПоказаний();
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПустойЛицевойСчет()
	
	Возврат Справочники.бит_ЛицевыеСчета.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьВидОперацииПоказанияПодкрутки()
	
	Возврат Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки;
	
КонецФункции

&НаСервере
Функция ПолучитьПустойСписокЗданий()
	
	Возврат Справочники.бит_СписокЗданий.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьГрупповойТипСчетчика()
	
	Возврат Перечисления.бит_ТипСчетчика.Групповой;
	
КонецФункции

&НаСервере
Функция ПолучитьПустуюУлицу()
	
	Возврат Справочники.бит_СписокУлиц.ПустаяСсылка();
	
КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Процедура ИзменитьУсловноеОформлениеНаСервере(Использование)
	
	ЭтаФорма.УсловноеОформление.Элементы.Получить(1).Использование                    = Использование;
	ЭтаФорма.УсловноеОформление.Элементы.Получить(1).Отбор.Элементы[0].ПравоеЗначение = ЭтаФорма.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КвартираНачалоВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КвартираНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	//Отбор.Вставить("Организация", Объект.Организация);		
	Отбор.Вставить("Улица", Объект.Улица);
	Отбор.Вставить("Здание",Объект.Дом);

	ОткрытьФорму("Справочник.бит_Квартиры.Форма.ФормаВыбораУправляемая", Новый Структура("ОтборПоУлицеЗданию", Отбор), Элемент);	

КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Улица) Тогда
		
		Объект.Улица = ПолучитьУлицуДома(Объект.Дом);
		
	КонецЕсли;
	
	Объект.ЛицевойСчет = Неопределено;
	
	Объект.ПоказанияПоСчетчикам.Очистить();
	
	ЗаполнитьТаблицуПоказанийНаСервере();
	
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоКвартире(Команда)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	ДокументОбъект.ЗаполнитьТаблицуПоказаний(истина);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
	ПодготовитьФормуНаСервере(истина);

КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоКвартире(Команда)
	СортироватьПоКвартиреНаСервере();
КонецПроцедуры

&НаСервере
Процедура СортироватьПоКвартиреНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
	если ПоказанияЗаполнены() = ложь тогда
	
	 ДокументОбъект.ЗаполнитьТаблицуПоказаний(истина);	
	 ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	 
	конецесли;
	
	ПодготовитьФормуНаСервере(истина);

КонецПроцедуры

функция ПоказанияЗаполнены()	
	для каждого стр из объект.ПоказанияПоСчетчикам цикл
		если стр.ТекущиеПоказания <> 0 тогда
		 возврат истина;
		конецесли;	
	конеццикла;
	
	возврат ложь;
конецфункции

// БИТ ЖКХ 02.04.2021
&НаСервере
Процедура ЧислоПоказанияНаселенияПриИзмененииНаСервере()
	Объект.ПоказанияНаселения = НЕ ЧислоПоказанияНаселения;
КонецПроцедуры


&НаКлиенте
Процедура ЧислоПоказанияНаселенияПриИзменении(Элемент)
	ЧислоПоказанияНаселенияПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти
